       IDENTIFICATION DIVISION.
       PROGRAM-ID. HexToTextConverter.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 Hexadecimal-Input PIC X(100).
       01 Text-Output PIC X(100).

       PROCEDURE DIVISION.
           DISPLAY "Digite o valor hexadecimal: ".
           ACCEPT Hexadecimal-Input.

           MOVE FUNCTION UNSTRING(Hexadecimal-Input DELIMITED BY SPACE
                                   INTO Text-Output)
           TO Text-Output.

           DISPLAY "Valor convertido para texto: " Text-Output.

           STOP RUN.

// abra o próximo arquivo  "Code-Hexa" e veja. // A senha é sua data de nascimento (dd/mm/aaaa).
// https://www.4shared.com/s/fHdc2WhpYge  // 
